cylinder/blockmesh/1ms/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
16126
(
(1 2.4632244e-15 0)
(1 5.1861916e-16 0)
(1 1.2507256e-16 0)
(1 3.3644358e-17 0)
(1 1.0026298e-17 0)
(1 3.4943948e-18 0)
(1 1.647485e-18 0)
(1 1.1587573e-18 0)
...
)
;

boundaryField
{
    oversetFaces
    {
        type            overset;
        coupledFringe   true;
        conservativeCorrection false;
        setHoleCellValue yes;
        holeCellValue   (0 0 0);
        value           nonuniform 0();
    }
    back
    {
        type            empty;
    }
    out
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    in
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    front
    {
        type            empty;
    }
    sides
    {
        type            empty;
    }
    cylinder
    {
        type            zeroGradient;
    }
    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
