cylinder/blockmesh/1ms/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
16126
(
-1.4476704e-16
-9.2666676e-17
-7.821038e-17
-7.2840768e-17
-6.9928133e-17
-6.7764447e-17
-6.5881944e-17
-6.4153026e-17
...
)
;

boundaryField
{
    oversetFaces
    {
        type            overset;
        coupledFringe   true;
        conservativeCorrection true;
        setHoleCellValue yes;
        holeCellValue   0;
        value           nonuniform 0();
    }
    back
    {
        type            empty;
    }
    out
    {
        type            fixedValue;
        value           uniform 0;
    }
    bottom
    {
        type            zeroGradient;
    }
    in
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    sides
    {
        type            empty;
    }
    cylinder
    {
        type            zeroGradient;
    }
    wall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
