cylinder/blockmesh/1ms/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
31929
(
-0.04838709
-2.3837608e-18
-0.04838709
-5.0189058e-19
-0.04838709
-1.2103772e-19
-0.04838709
-3.2559125e-20
...
)
;

boundaryField
{
    oversetFaces
    {
        type            overset;
        value           nonuniform 0();
    }
    back
    {
        type            empty;
    }
    out
    {
        type            calculated;
        value           nonuniform List<scalar> 
124
(
0.04838709
0.04838709
0.04838712
0.04838709
0.04838709
0.04838709
0.04838712
0.04838709
...
)
;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    in
    {
        type            calculated;
        value           nonuniform List<scalar> 
124
(
-0.04838709
-0.04838709
-0.04838712
-0.04838709
-0.04838709
-0.04838709
-0.04838712
-0.04838709
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            empty;
    }
    sides
    {
        type            empty;
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
75
(
0.02510334
0.0249273
0.02457636
0.0240528
0.023361
0.0225054
0.0214914
0.0203268
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
